source/_posts/2015-10-31-things-i-wish-i-know-when-i-am-learning-emacs.html
---
title: "Things I Wish I Know When I Am Learning Emacs"
date: 2015-10-31
layout: post
categories: 
- Emacs
tags: 
- Emacs
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">一定要使用 Starter Kit</a></li>
<li><a href="#orgheadline2">Package 管理和依赖</a></li>
<li><a href="#orgheadline3">按键绑定</a>
<ul>
<li><a href="#orgheadline4">按键绑定的覆盖问题</a></li>
<li><a href="#orgheadline5">快捷键太多，记不住怎么办？</a></li>
</ul>
</li>
<li><a href="#orgheadline6">有问题问 Emacs</a></li>
<li><a href="#orgheadline7">Happy Hacking</a></li>
</ul>
</div>
</div>
<p>
当我在学习 Emacs 的时候，有一些事情，我希望有人能够提前告诉我。
</p>

<p>
这样的话，我便可以少走一些弯路。
</p>

<p>
<!-- more -->
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">一定要使用 Starter Kit</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
对于 Emacs 新手而言，一定要使用 Starter Kit！
</p>

<p>
虽然有很多人喜欢从零开始捣腾，但是，真的不要这样。一来浪费大量的时间不说，而且通常只有学习能力非常强而且毅力也非常好的人才能从零开始配置并坚持下来。
</p>

<p>
当然，如果你觉得 Starter Kit 满足不了你的需求，你是可以很轻松地进行扩展的。
</p>

<p>
好的 Starter Kit 通常都是 Emacs 社区里面的高手开发的，它们的模块化，加载时间，按键绑定都是经过精心优化的。向高手学习，在初学阶段是非常重要的。这一点，陈斌在他的《一年成为 Emacs 高手》中也提到了。
</p>

<p>
如果以前是 IDE 重度用户，推荐从<a href="https://github.com/bbatsov/prelude">bbatsov/prelude</a> 开始入手。
</p>

<p>
如果你是 Vim 用户，推荐从 <a href="https://github.com/syl20bnr/spacemacs">syl20bnr/spacemacs</a> 入手。
</p>

<p>
这两个 starter kit 都有非常详细的文档，入手之前一定要认真阅读文档。在上手以后，还需要不断地反复阅读文档并动手实践。遇到问题可以去 Github 上面提 issue。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Package 管理和依赖</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
刚开始学习 Emacs 的时候一定要学会使用包管理器，能够从 melpa 下载包。
</p>

<p>
每一个 Package 要么定义了一堆功能函数，要么定义了一个 major mode 或者 minor mode。
</p>

<p>
不要一味地使用 require，这样的话会导致你的 Emacs 加载时间变长。 最好使用  <a href="https://github.com/jwiegley/use-package">jwiegley/use-package</a>， 它不仅可以智能地引入 package。比如当你的 elpa 目录的一个 package 不存在的时候，直接使用 require 是会报错的。但是使用 use-package 的话就不会。
</p>

<p>
另外，use-package 还可以优雅地管理你的配置。比如有一些 mode 相关的变量，在 mode 还没有激活的时候，去设置它们没有用的。
</p>

<p>
这时你需要使用 eval-after-load，然后把相关的设置放进去。 而使用 use-package 的话，就可以非常方便地使用 :defer t 和 :config 了。
</p>

<p>
最后，有一些 Package 之间是存在依赖的，如果加载顺序不对也不行。这里推荐大家试试<a href="https://github.com/edvorg/req-package"> edvorg/req-package</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">按键绑定</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
按键绑定，也叫"快捷键绑定"，它本质上只是用一个 Hotkey 去调用一个交互式命令。
</p>

<p>
如下所示，我定义了 C-c C-1 快捷键，它可以在当前的 buffer 位置插入一个“Hello World”的字符串。
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">print-hello-world</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>insert <span style="color: #2aa198;">"Hello World"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c C-1"</span><span style="color: #b58900;">)</span> 'print-hello-world<span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
这里需要注意的是，print-hello-world 函数必须是 interactive 的，否则是不可以绑定一个快捷键的。
</p>

<p>
一个函数被定义成 interactive 以后，我们就可以通过 M-x 来调用它，如果你发现此函数经常被调用，此时就可以通过定义一个快捷键来解决效率问题了。
</p>

<p>
上面所提到的快捷键绑定是 99%的 Emacs 党都知道的。
</p>

<p>
但是，有一些事情可能并不是所有人都清楚。
</p>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">按键绑定的覆盖问题</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
有时候，我们定义了一堆快捷键，但是某一天安装完一个 Package 后，突然发现以前的快捷键失效了。通常这是由于某些 minor mode 的快捷键的优先级比你的高，所以被它覆盖了。这里强烈推荐大家看看 <a href="https://www.masteringemacs.org/article/mastering-key-bindings-emacs">Mastering Key Bindings in Emacs - Mastering Emacs</a> ，看完之后相信会对 Emacs 的按键绑定有更多的认识。
</p>

<p>
这里面有一些小技巧，可以保证你自己定义的快捷键不容易被覆盖。
</p>

<p>
对于正统 Emacs 用户，定义的快捷键默认最好以 C-c 开头，因为 C-c 是 Emacs 预留给用户使用的，当然某些 minor mode 也会使用 C-c 开头。此时，你可以通过定义一个
minor mode 并且让这个 minor mode 最后加载，然后把你所有的自定义快捷键都放在新定义的 minor mode 里面，这样你的快捷键就不会被覆盖了。
</p>

<p>
著名的 Emacs Starter Kit Prelude 就是使用的这个方式。
</p>

<p>
对于 Evil 用户，建议使用 evil/leader 来定义快捷键。更合理的方式是像 Spacemacs 一样，分组来定义。
</p>

<p>
最后，对于 Spacemacs 用户，建议使用 SPC o 来定义自己的快捷键。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">快捷键太多，记不住怎么办？</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
很多初学者抱怨 Emacs 的按键太复杂，伤小拇指。或者抱怨 Emacs 的按键太多，记不住。
</p>

<p>
其实，你根本就不需要快捷键。
</p>

<p>
通过 smex + ido，你可以用交互式的方式来执行 Emacs 的命令。当然，你也可以使用 Helm 来搜索并执行命令。因为你日常经常用的命令不会太多，所以，其实是不推荐定义太多快捷键的。直接使用命令有时候会更快，因为你大脑的负担更轻。
</p>

<p>
其实你根本就不需要记忆。
</p>

<p>
你可以通过 <a href="https://github.com/abo-abo/hydra">abo-abo/hydra</a> 和 <a href="https://github.com/justbur/emacs-which-key">justbur/emacs-which-key</a> 来交互式地显示所有的按键绑定。
</p>

<p>
最后，Evil 也是一个极佳的方案。Vim 和 Emacs 专注在两个不同的领域，Vim 把编辑器操作发挥到了极致，而 Emacs 在与系统集成方面也做到了极致。
</p>

<p>
而 Spacemacs 让这一切更和谐。
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">有问题问 Emacs</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
在学习 Emacs 的过程中，一定要经常问 Emacs 一些问题。
</p>

<p>
比如这个函数是干什么用的？（C-h f） 这个按键对应的函数是什么？（C-h k）这个变量是干什么用的？（C-h v）
</p>

<p>
一定要学一点 elisp，Emacs 自带的《Introduction to Elisp》就很不错。
</p>

<p>
在使用 Starter Kit 的过程中，有事没事，读一读它们的源码。这样也有利于你在扩展自己的配置的时候，遵循的是此 Starter Kit 的最佳实践。
</p>

<p>
实在是搞不定了再问 Google，最后才去社区里面提问：
</p>

<p>
社区提问的优先级是：StackOverflow  -&gt; Reddit -&gt;  Google+ -&gt; Github issue -&gt; 最后才是 Q 群和微信群
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">Happy Hacking</h2>
</div>
